CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/clock_manager/src/sl_clock_manager_hal_s2.c
/***************************************************************************//**
 * @file
 * @brief Clock Manager HAL API implementations.
 *******************************************************************************
 * # License
 * <b>Copyright 2023 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#include <stddef.h>
#include "sl_clock_manager.h"
#include "sli_clock_manager.h"
#include "sli_clock_manager_hal.h"
#include "em_cmu.h"
#include "em_bus.h"
#include "em_device.h"
#include "em_gpio.h"

/***************************************************************************//**
 * Performs Clock Manager runtime initialization.
 ******************************************************************************/
sl_status_t sli_clock_manager_hal_runtime_init(void)
{
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Gets frequency of given oscillator.
 ******************************************************************************/
sl_status_t sli_clock_manager_hal_get_oscillator_frequency(sl_oscillator_t oscillator,
                                                           uint32_t        *frequency)
{
  switch (oscillator) {
    case SL_OSCILLATOR_FSRCO:
      *frequency = SystemFSRCOClockGet();
      break;

    case SL_OSCILLATOR_HFXO:
      *frequency = SystemHFXOClockGet();
      break;

    case SL_OSCILLATOR_HFRCODPLL:
      *frequency = SystemHFRCODPLLClockGet();
      break;

#if defined(HFRCOEM23_PRESENT)
    case SL_OSCILLATOR_HFRCOEM23:
      *frequency = SystemHFRCOEM23ClockGet();
      break;
#endif

#if defined(RFFPLL_PRESENT)
    case SL_OSCILLATOR_RFFPLL:
      *frequency = SystemRFFPLLClockGet();
      break;
#endif

#if defined(USBPLL_PRESENT)
    case SL_OSCILLATOR_USBPLL:
      *frequency = CMU_ClockFreqGet(cmuClock_USB);
      break;
#endif

    case SL_OSCILLATOR_LFXO:
      *frequency = SystemLFXOClockGet();
      break;

    case SL_OSCILLATOR_LFRCO:
      *frequency = SystemLFRCOClockGet();
      break;

    case SL_OSCILLATOR_ULFRCO:
      *frequency = SystemULFRCOClockGet();
      break;

    default:
      *frequency = 0U;
      return SL_STATUS_INVALID_PARAMETER;
  }

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Gets precision of given oscillator.
 ******************************************************************************/
sl_status_t sli_clock_manager_hal_get_oscillator_precision(sl_oscillator_t oscillator,
                                                           uint16_t        *precision)
{
  switch (oscillator) {
    case SL_OSCILLATOR_HFXO:
      *precision = CMU_HFXOPrecisionGet();
      break;

    case SL_OSCILLATOR_LFXO:
      *precision = CMU_LFXOPrecisionGet();
      break;

    case SL_OSCILLATOR_LFRCO:
#if defined(LFRCO_CFG_HIGHPRECEN)
      if (LFRCO->CFG & _LFRCO_CFG_HIGHPRECEN_MASK) {
        *precision = 500;
      } else {
        *precision = 0xFFFF;
        return SL_STATUS_NOT_AVAILABLE;
      }
#else
      *precision = 0xFFFF;
      return SL_STATUS_NOT_AVAILABLE;
#endif
      break;

    case SL_OSCILLATOR_FSRCO:
    case SL_OSCILLATOR_HFRCODPLL:
    case SL_OSCILLATOR_ULFRCO:
#if defined(HFRCOEM23_PRESENT)
    case SL_OSCILLATOR_HFRCOEM23:
#endif
      *precision = 0xFFFF;
      return SL_STATUS_NOT_AVAILABLE;

#if defined(RFFPLL_PRESENT)
    case SL_OSCILLATOR_RFFPLL:
      *precision = 0xFFFF;
      return SL_STATUS_NOT_AVAILABLE;
#endif

#if defined(USBPLL_PRESENT)
    case SL_OSCILLATOR_USBPLL:
      *precision = 0xFFFF;
      return SL_STATUS_NOT_AVAILABLE;
#endif

    default:
      *precision = 0;
      return SL_STATUS_INVALID_PARAMETER;
  }

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Gets frequency of given clock branch.
 ******************************************************************************/
sl_status_t sli_clock_manager_hal_get_clock_branch_frequency(sl_clock_branch_t clock_branch,
                                                             uint32_t                        *frequency)
{
  switch (clock_branch) {
    case SL_CLOCK_BRANCH_SYSCLK:
      *frequency = SystemSYSCLKGet();
      break;

    case SL_CLOCK_BRANCH_HCLK:
      *frequency = CMU_ClockFreqGet(cmuClock_HCLK);
      break;

    case SL_CLOCK_BRANCH_PCLK:
      *frequency = CMU_ClockFreqGet(cmuClock_PCLK);
      break;

    case SL_CLOCK_BRANCH_LSPCLK:
      *frequency = CMU_ClockFreqGet(cmuClock_LSPCLK);
      break;

#if defined(_CMU_TRACECLKCTRL_MASK)
    case SL_CLOCK_BRANCH_TRACECLK:
      *frequency = CMU_ClockFreqGet(cmuClock_TRACECLK);
      break;
#endif
#if defined(_CMU_EXPORTCLKCTRL_MASK)
    case SL_CLOCK_BRANCH_EXPORTCLK:
      *frequency = CMU_ClockFreqGet(cmuClock_EXPCLK);
      break;
#endif
#if defined(_CMU_EM01GRPACLKCTRL_MASK)
    case SL_CLOCK_BRANCH_EM01GRPACLK:
      *frequency = CMU_ClockFreqGet(cmuClock_EM01GRPACLK);
      break;
#endif
#if defined(_CMU_EM01GRPBCLKCTRL_MASK)
    case SL_CLOCK_BRANCH_EM01GRPBCLK:
      *frequency = CMU_ClockFreqGet(cmuClock_EM01GRPBCLK);
      break;
#endif
#if defined(_CMU_EM01GRPCCLKCTRL_MASK)
    case SL_CLOCK_BRANCH_EM01GRPCCLK:
      *frequency = CMU_ClockFreqGet(cmuClock_EM01GRPCCLK);
      break;
#endif
#if defined(_CMU_EM23GRPACLKCTRL_MASK)
    case SL_CLOCK_BRANCH_EM23GRPACLK:
      *frequency = CMU_ClockFreqGet(cmuClock_EM23GRPACLK);
      break;
#endif
#if defined(_CMU_EM4GRPACLKCTRL_MASK)
    case SL_CLOCK_BRANCH_EM4GRPACLK:
      *frequency = CMU_ClockFreqGet(cmuClock_EM4GRPACLK);
      break;
#endif
#if defined(_CMU_IADCCLKCTRL_MASK)
    case SL_CLOCK_BRANCH_IADCCLK:
      *frequency = CMU_ClockFreqGet(cmuClock_IADCCLK);
      break;
#endif
#if defined(_CMU_WDOG0CLKCTRL_MASK)
    case SL_CLOCK_BRANCH_WDOG0CLK:
      *frequency = CMU_ClockFreqGet(cmuClock_WDOG0CLK);
      break;
#endif
#if defined(_CMU_WDOG1CLKCTRL_MASK)
    case SL_CLOCK_BRANCH_WDOG1CLK:
      *frequency = CMU_ClockFreqGet(cmuClock_WDOG1CLK);
      break;
#endif
#if defined(_CMU_RTCCCLKCTRL_MASK)
    case SL_CLOCK_BRANCH_RTCCCLK:
      *frequency = CMU_ClockFreqGet(cmuClock_RTCCCLK);
      break;
#endif
#if defined(_CMU_SYSRTC0CLKCTRL_MASK)
    case SL_CLOCK_BRANCH_SYSRTCCLK:
      *frequency = CMU_ClockFreqGet(cmuClock_SYSRTCCLK);
      break;
#endif
#if defined(_CMU_EUART0CLKCTRL_MASK)
    case SL_CLOCK_BRANCH_EUART0CLK:
      *frequency = CMU_ClockFreqGet(cmuClock_EUART0CLK);
      break;
#endif
#if defined(_CMU_EUSART0CLKCTRL_MASK)
    case SL_CLOCK_BRANCH_EUSART0CLK:
      *frequency = CMU_ClockFreqGet(cmuClock_EUSART0CLK);
      break;
#endif
#if defined(_CMU_LCDCLKCTRL_MASK)
    case SL_CLOCK_BRANCH_LCDCLK:
      *frequency = CMU_ClockFreqGet(cmuClock_LCDCLK);
      break;
#endif
#if defined(_CMU_PCNT0CLKCTRL_MASK)
    case SL_CLOCK_BRANCH_PCNT0CLK:
      *frequency = CMU_ClockFreqGet(cmuClock_PCNT0CLK);
      break;
#endif

    case SL_CLOCK_BRANCH_SYSTICKCLK:
      *frequency = CMU_ClockFreqGet(cmuClock_SYSTICK);
      break;

