CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/clock_manager/src/sl_clock_manager_hal_s2.c
#if defined(_CMU_LESENSEHFCLKCTRL_MASK)
    case SL_CLOCK_BRANCH_LESENSEHFCLK:
      *frequency = CMU_ClockFreqGet(cmuClock_LESENSEHFCLK);
      break;
#endif
#if defined(_CMU_VDAC0CLKCTRL_MASK)
    case SL_CLOCK_BRANCH_VDAC0CLK:
      *frequency = CMU_ClockFreqGet(cmuClock_VDAC0CLK);
      break;
#endif
#if defined(_CMU_VDAC1CLKCTRL_MASK)
    case SL_CLOCK_BRANCH_VDAC1CLK:
      *frequency = CMU_ClockFreqGet(cmuClock_VDAC1CLK);
      break;
#endif
#if defined(_CMU_USB0CLKCTRL_MASK)
    case SL_CLOCK_BRANCH_USB0CLK:
      *frequency = CMU_ClockFreqGet(cmuClock_USB);
      break;
#endif

    default:
      *frequency = 0U;
      return SL_STATUS_INVALID_PARAMETER;
  }

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Gets precision of given clock branch.
 ******************************************************************************/
sl_status_t sli_clock_manager_hal_get_clock_branch_precision(sl_clock_branch_t clock_branch,
                                                             uint16_t                        *precision)
{
  switch (clock_branch) {
    case SL_CLOCK_BRANCH_SYSCLK:
    case SL_CLOCK_BRANCH_HCLK:
    case SL_CLOCK_BRANCH_PCLK:
    case SL_CLOCK_BRANCH_LSPCLK:
    case SL_CLOCK_BRANCH_EXPORTCLK:
      *precision = CMU_HF_ClockPrecisionGet(cmuClock_SYSCLK);
      if (*precision == 0xFFFF) {
        return SL_STATUS_NOT_AVAILABLE;
      }
      break;

#if defined(_CMU_TRACECLKCTRL_MASK)
    case SL_CLOCK_BRANCH_TRACECLK:
#if defined(_CMU_TRACECLKCTRL_CLKSEL_MASK)
      // PLATFORM_MTL-7602
      *precision = 0U;
      return SL_STATUS_NOT_SUPPORTED;
#else
      *precision = CMU_HF_ClockPrecisionGet(cmuClock_SYSCLK);
      if (*precision == 0xFFFF) {
        return SL_STATUS_NOT_AVAILABLE;
      }
#endif
      break;

#endif
#if defined(_CMU_EM01GRPACLKCTRL_MASK)
    case SL_CLOCK_BRANCH_EM01GRPACLK:
      *precision = CMU_HF_ClockPrecisionGet(cmuClock_EM01GRPACLK);
      if (*precision == 0xFFFF) {
        return SL_STATUS_NOT_AVAILABLE;
      }
      break;
#endif
#if defined(_CMU_EM01GRPBCLKCTRL_MASK)
    case SL_CLOCK_BRANCH_EM01GRPBCLK:
      *precision = CMU_HF_ClockPrecisionGet(cmuClock_EM01GRPBCLK);
      if (*precision == 0xFFFF) {
        return SL_STATUS_NOT_AVAILABLE;
      }
      break;
#endif
#if defined(_CMU_EM01GRPCCLKCTRL_MASK)
    case SL_CLOCK_BRANCH_EM01GRPCCLK:
      *precision = CMU_HF_ClockPrecisionGet(cmuClock_EM01GRPCCLK);
      if (*precision == 0xFFFF) {
        return SL_STATUS_NOT_AVAILABLE;
      }
      break;
#endif
#if defined(_CMU_EM23GRPACLKCTRL_MASK)
    case SL_CLOCK_BRANCH_EM23GRPACLK:
      *precision = CMU_LF_ClockPrecisionGet(cmuClock_EM23GRPACLK);
      if (*precision == 0xFFFF) {
        return SL_STATUS_NOT_AVAILABLE;
      }
      break;
#endif
#if defined(_CMU_EM4GRPACLKCTRL_MASK)
    case SL_CLOCK_BRANCH_EM4GRPACLK:
      *precision = CMU_LF_ClockPrecisionGet(cmuClock_EM4GRPACLK);
      if (*precision == 0xFFFF) {
        return SL_STATUS_NOT_AVAILABLE;
      }
      break;
#endif
#if defined(_CMU_IADCCLKCTRL_MASK)
    case SL_CLOCK_BRANCH_IADCCLK:
      // PLATFORM_MTL-7602
      *precision = 0U;
      return SL_STATUS_NOT_SUPPORTED;
#endif
#if defined(_CMU_WDOG0CLKCTRL_MASK)
    case SL_CLOCK_BRANCH_WDOG0CLK:
      // PLATFORM_MTL-7602
      *precision = 0U;
      return SL_STATUS_NOT_SUPPORTED;
#endif
#if defined(_CMU_WDOG1CLKCTRL_MASK)
    case SL_CLOCK_BRANCH_WDOG1CLK:
      // PLATFORM_MTL-7602
      *precision = 0U;
      return SL_STATUS_NOT_SUPPORTED;
#endif
#if defined(_CMU_RTCCCLKCTRL_MASK)
    case SL_CLOCK_BRANCH_RTCCCLK:
      *precision = CMU_LF_ClockPrecisionGet(cmuClock_RTCCCLK);
      if (*precision == 0xFFFF) {
        return SL_STATUS_NOT_AVAILABLE;
      }
      break;
#endif
#if defined(_CMU_SYSRTC0CLKCTRL_MASK)
    case SL_CLOCK_BRANCH_SYSRTCCLK:
      *precision = CMU_LF_ClockPrecisionGet(cmuClock_SYSRTCCLK);
      if (*precision == 0xFFFF) {
        return SL_STATUS_NOT_AVAILABLE;
      }
      break;
#endif
#if defined(_CMU_EUART0CLKCTRL_MASK)
    case SL_CLOCK_BRANCH_EUART0CLK:
      // PLATFORM_MTL-7602
      *precision = 0U;
      return SL_STATUS_NOT_SUPPORTED;
#endif
#if defined(_CMU_EUSART0CLKCTRL_MASK)
    case SL_CLOCK_BRANCH_EUSART0CLK:
      // PLATFORM_MTL-7602
      *precision = 0U;
      return SL_STATUS_NOT_SUPPORTED;
#endif
#if defined(_CMU_LCDCLKCTRL_MASK)
    case SL_CLOCK_BRANCH_LCDCLK:
      *precision = CMU_LF_ClockPrecisionGet(cmuClock_LCDCLK);
      if (*precision == 0xFFFF) {
        return SL_STATUS_NOT_AVAILABLE;
      }
      break;
#endif
#if defined(_CMU_PCNT0CLKCTRL_MASK)
    case SL_CLOCK_BRANCH_PCNT0CLK:
      // PLATFORM_MTL-7602
      *precision = 0U;
      return SL_STATUS_NOT_SUPPORTED;
#endif

    case SL_CLOCK_BRANCH_SYSTICKCLK:
      // PLATFORM_MTL-7602
      *precision = 0U;
      return SL_STATUS_NOT_SUPPORTED;

#if defined(_CMU_LESENSEHFCLKCTRL_MASK)
    case SL_CLOCK_BRANCH_LESENSEHFCLK:
      *precision = CMU_HF_ClockPrecisionGet(cmuClock_LESENSEHFCLK);
      if (*precision == 0xFFFF) {
        return SL_STATUS_NOT_AVAILABLE;
      }
      break;
#endif
#if defined(_CMU_VDAC0CLKCTRL_MASK)
    case SL_CLOCK_BRANCH_VDAC0CLK:
      // PLATFORM_MTL-7602
      *precision = 0U;
      return SL_STATUS_NOT_SUPPORTED;
#endif
#if defined(_CMU_VDAC1CLKCTRL_MASK)
    case SL_CLOCK_BRANCH_VDAC1CLK:
      // PLATFORM_MTL-7602
      *precision = 0U;
      return SL_STATUS_NOT_SUPPORTED;
#endif
#if defined(_CMU_USB0CLKCTRL_MASK)
    case SL_CLOCK_BRANCH_USB0CLK:
      // PLATFORM_MTL-7602
      *precision = 0U;
      return SL_STATUS_NOT_SUPPORTED;
#endif

    default:
      *precision = 0U;
      return SL_STATUS_INVALID_PARAMETER;
  }

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Enables/Disables the bus clock associated with the given module.
 ******************************************************************************/
sl_status_t sli_clock_manager_hal_enable_bus_clock(sl_bus_clock_t module, bool enable)
{
#if defined(_SILICON_LABS_32B_SERIES_2_CONFIG) && (_SILICON_LABS_32B_SERIES_2_CONFIG > 1)
  volatile uint32_t *reg = NULL;
  uint32_t bit;
  uint32_t clken_index;

  if (module == SL_BUS_CLOCK_INVALID) {
    return SL_STATUS_NOT_AVAILABLE;
  }

