CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/clock_manager/src/sl_clock_manager_hal_s2.c
  bit = (*module & _BUS_CLOCK_CLKEN_BIT_MASK) >> _BUS_CLOCK_CLKEN_BIT_SHIFT;
  clken_index = (*module & _BUS_CLOCK_CLKENX_MASK) >> _BUS_CLOCK_CLKENX_SHIFT;

  if (clken_index == BUS_CLOCK_CLKEN0) {
    reg = &CMU->CLKEN0;
  } else if (clken_index == BUS_CLOCK_CLKEN1) {
    reg = &CMU->CLKEN1;
#if defined(_CMU_CLKEN2_MASK)
  } else if (clken_index == BUS_CLOCK_CLKEN2) {
    reg = &CMU->CLKEN2;
#endif
  } else {
    return SL_STATUS_NOT_AVAILABLE;
  }

  // Enable/disable bus clock.
  BUS_RegBitWrite(reg, bit, (uint32_t)enable);
#else // defined(_SILICON_LABS_32B_SERIES_2_CONFIG) && (_SILICON_LABS_32B_SERIES_2_CONFIG > 1)
  (void)enable;
  (void)module;
#endif

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Enables/Disables the peripheral clock associated with the given peripheral.
 ******************************************************************************/
sl_status_t sli_clock_manager_hal_enable_peripheral_clock(sl_clock_manager_peripheral_clock_t peripheral, bool enable)
{
  (void)peripheral;
  (void)enable;
  return SL_STATUS_NOT_SUPPORTED;
}

/***************************************************************************//**
 * Configure the exported clock feature on CMU to output user selected
 * clock source specified GPIO pin.
 ******************************************************************************/
sl_status_t sli_clock_manager_hal_set_gpio_clock_output(sl_clock_manager_export_clock_source_t export_clock_source,
                                                        sl_clock_manager_export_clock_output_select_t output_select,
                                                        uint16_t divider,
                                                        uint32_t port,
                                                        uint32_t pin)
{
  CMU_Select_TypeDef cmu_clock_select;

  switch (export_clock_source) {
    case SL_CLOCK_MANAGER_EXPORT_CLOCK_SOURCE_DISABLED:
      cmu_clock_select = cmuSelect_Disabled;
      break;
#if defined(FSRCO_PRESENT)
    case SL_CLOCK_MANAGER_EXPORT_CLOCK_SOURCE_FSRCO:
      cmu_clock_select = cmuSelect_FSRCO;
      break;
#endif
#if defined(HFXO_PRESENT)
    case SL_CLOCK_MANAGER_EXPORT_CLOCK_SOURCE_HFXO:
      cmu_clock_select = cmuSelect_HFXO;
      break;
#endif
#if defined(DPLL_PRESENT)
    case SL_CLOCK_MANAGER_EXPORT_CLOCK_SOURCE_HFRCODPLL:
      cmu_clock_select = cmuSelect_HFRCODPLL;
      break;
#endif
#if defined(HFRCOEM23_PRESENT)
    case SL_CLOCK_MANAGER_EXPORT_CLOCK_SOURCE_HFRCOEM23:
      cmu_clock_select = cmuSelect_HFRCOEM23;
      break;
#endif
    case SL_CLOCK_MANAGER_EXPORT_CLOCK_SOURCE_HFEXPCLK:
      cmu_clock_select  = cmuSelect_EXPCLK;
      break;
#if defined(LFXO_PRESENT)
    case SL_CLOCK_MANAGER_EXPORT_CLOCK_SOURCE_LFXO:
      cmu_clock_select = cmuSelect_LFXO;
      break;
#endif
#if defined(PLFRCO_PRESENT)
    case SL_CLOCK_MANAGER_EXPORT_CLOCK_SOURCE_PLFRCO:
      cmu_clock_select = cmuSelect_PLFRCO;
      break;
#endif
#if defined(LFRCO)
    case SL_CLOCK_MANAGER_EXPORT_CLOCK_SOURCE_LFRCO:
      cmu_clock_select = cmuSelect_LFRCO;
      break;
#endif
#if defined(ULFRCO)
    case SL_CLOCK_MANAGER_EXPORT_CLOCK_SOURCE_ULFRCO:
      cmu_clock_select = cmuSelect_ULFRCO;
      break;
#endif
    case SL_CLOCK_MANAGER_EXPORT_CLOCK_SOURCE_HCLK:
      cmu_clock_select = cmuSelect_HCLK;
      break;

    default:
      return SL_STATUS_NOT_SUPPORTED;
  }

  CMU_ClkOutPinConfig((uint32_t)output_select, cmu_clock_select, (CMU_ClkDiv_TypeDef)divider, port, pin);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Set the RC oscillator frequency tuning control.
 ******************************************************************************/
sl_status_t sli_clock_manager_hal_set_rc_oscillator_calibration(sl_oscillator_t oscillator,
                                                                uint32_t val)
{
  switch (oscillator) {
    case SL_OSCILLATOR_HFRCODPLL:
      CMU_OscillatorTuningSet(cmuOsc_HFRCODPLL, val);
      break;

#if defined(HFRCOEM23_PRESENT)
    case SL_OSCILLATOR_HFRCOEM23:
      CMU_OscillatorTuningSet(cmuOsc_HFRCOEM23, val);
      break;
#endif

    case SL_OSCILLATOR_LFRCO:
      CMU_OscillatorTuningSet(cmuOsc_LFRCO, val);
      break;

    default:
      return SL_STATUS_NOT_SUPPORTED;
  }

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Get the RC oscillator frequency tuning setting.
 ******************************************************************************/
sl_status_t sli_clock_manager_hal_get_rc_oscillator_calibration(sl_oscillator_t oscillator,
                                                                uint32_t *val)
{
  switch (oscillator) {
    case SL_OSCILLATOR_HFRCODPLL:
      *val = CMU_OscillatorTuningGet(cmuOsc_HFRCODPLL);
      break;

#if defined(HFRCOEM23_PRESENT)
    case SL_OSCILLATOR_HFRCOEM23:
      *val = CMU_OscillatorTuningGet(cmuOsc_HFRCOEM23);
      break;
#endif

    case SL_OSCILLATOR_LFRCO:
      *val = CMU_OscillatorTuningGet(cmuOsc_LFRCO);
      break;

    default:
      *val = 0;
      return SL_STATUS_NOT_SUPPORTED;
  }

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Set HFXO frequency tuning control.
 ******************************************************************************/
sl_status_t sli_clock_manager_hal_set_hfxo_calibration(uint32_t val)
{
  CMU_OscillatorTuningSet(cmuOsc_HFXO, val);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Get the HFXO frequency tuning setting.
 ******************************************************************************/
sl_status_t sli_clock_manager_hal_get_hfxo_calibration(uint32_t *val)
{
  *val = CMU_OscillatorTuningGet(cmuOsc_HFXO);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Set the HFXO CTUNE setting.
 ******************************************************************************/
sl_status_t sli_clock_manager_hal_hfxo_set_ctune(uint32_t ctune)
{
  return CMU_HFXOCTuneSet(ctune);
}

/***************************************************************************//**
 * Get the HFXO CTUNE setting.
 ******************************************************************************/
sl_status_t sli_clock_manager_hal_hfxo_get_ctune(uint32_t *ctune)
{
  *ctune = CMU_HFXOCTuneGet();

