CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/clock_manager/src/sl_clock_manager_hal_s2.c
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Update the tuning capacitances and calibrate the Core Bias Current.
 ******************************************************************************/
sl_status_t sli_clock_manager_hal_hfxo_calibrate_ctune(uint32_t ctune)
{
  uint32_t hfxo_ctrl_backup = HFXO0->CTRL;

  // Having the FORCEEN here prevents the enabling and disabling of HFXO in
  // each function calls.
  HFXO0->CTRL_SET = HFXO_CTRL_FORCEEN;
  while ((HFXO0->STATUS & (HFXO_STATUS_COREBIASOPTRDY | HFXO_STATUS_RDY | HFXO_STATUS_ENS))
         != (HFXO_STATUS_COREBIASOPTRDY | HFXO_STATUS_RDY | HFXO_STATUS_ENS)) {
    // Wait for crystal to startup
  }

  sl_status_t status = CMU_HFXOCTuneSet(ctune);

  if (status == SL_STATUS_OK) {
    CMU_HFXOCoreBiasCurrentCalibrate();
  }

  BUS_RegMaskedWrite(&HFXO0->CTRL, _HFXO_CTRL_FORCEEN_MASK, hfxo_ctrl_backup);

  return status;
}

/***************************************************************************//**
 * Set LFXO frequency tuning control.
 ******************************************************************************/
sl_status_t sli_clock_manager_hal_set_lfxo_calibration(uint32_t val)
{
  CMU_OscillatorTuningSet(cmuOsc_LFXO, val);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Get the LFXO frequency tuning setting.
 ******************************************************************************/
sl_status_t sli_clock_manager_hal_get_lfxo_calibration(uint32_t *val)
{
  *val = CMU_OscillatorTuningGet(cmuOsc_LFXO);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Configures the RCO calibration.
 ******************************************************************************/
sl_status_t sli_clock_manager_hal_configure_rco_calibration(uint32_t cycles,
                                                            sl_clock_manager_clock_calibration_t down_counter_selection,
                                                            sl_clock_manager_clock_calibration_t up_counter_selection,
                                                            bool continuous_calibration)
{
  CMU_Select_TypeDef down_selection;
  CMU_Select_TypeDef up_selection;

  switch (down_counter_selection) {
    case SL_CLOCK_MANAGER_CLOCK_CALIBRATION_HFXO:
      down_selection = cmuSelect_HFXO;
      break;

    case SL_CLOCK_MANAGER_CLOCK_CALIBRATION_LFXO:
      down_selection = cmuSelect_LFXO;
      break;

    case SL_CLOCK_MANAGER_CLOCK_CALIBRATION_HFRCODPLL:
      down_selection = cmuSelect_HFRCODPLL;
      break;

#if defined(HFRCOEM23_PRESENT)
    case SL_CLOCK_MANAGER_CLOCK_CALIBRATION_HFRCOEM23:
      down_selection = cmuSelect_HFRCOEM23;
      break;
#endif

    case SL_CLOCK_MANAGER_CLOCK_CALIBRATION_FSRCO:
      down_selection = cmuSelect_FSRCO;
      break;

    case SL_CLOCK_MANAGER_CLOCK_CALIBRATION_LFRCO:
      down_selection = cmuSelect_LFRCO;
      break;

    case SL_CLOCK_MANAGER_CLOCK_CALIBRATION_ULFRCO:
      down_selection = cmuSelect_ULFRCO;
      break;

    case SL_CLOCK_MANAGER_CLOCK_CALIBRATION_PRS:
      down_selection = cmuSelect_PRS;
      break;

    case SL_CLOCK_MANAGER_CLOCK_CALIBRATION_HCLK:
      down_selection = cmuSelect_HCLK;
      break;

    default:
      return SL_STATUS_NOT_AVAILABLE;
  }

  switch (up_counter_selection) {
    case SL_CLOCK_MANAGER_CLOCK_CALIBRATION_HFXO:
      up_selection = cmuSelect_HFXO;
      break;

    case SL_CLOCK_MANAGER_CLOCK_CALIBRATION_LFXO:
      up_selection = cmuSelect_LFXO;
      break;

    case SL_CLOCK_MANAGER_CLOCK_CALIBRATION_HFRCODPLL:
      up_selection = cmuSelect_HFRCODPLL;
      break;

#if defined(HFRCOEM23_PRESENT)
    case SL_CLOCK_MANAGER_CLOCK_CALIBRATION_HFRCOEM23:
      up_selection = cmuSelect_HFRCOEM23;
      break;
#endif

    case SL_CLOCK_MANAGER_CLOCK_CALIBRATION_FSRCO:
      up_selection =  cmuSelect_FSRCO;
      break;

    case SL_CLOCK_MANAGER_CLOCK_CALIBRATION_LFRCO:
      up_selection = cmuSelect_LFRCO;
      break;

    case SL_CLOCK_MANAGER_CLOCK_CALIBRATION_ULFRCO:
      up_selection = cmuSelect_ULFRCO;
      break;

    case SL_CLOCK_MANAGER_CLOCK_CALIBRATION_PRS:
      up_selection = cmuSelect_PRS;
      break;

    case SL_CLOCK_MANAGER_CLOCK_CALIBRATION_HCLK:
      return SL_STATUS_NOT_SUPPORTED;

    default:
      return SL_STATUS_NOT_AVAILABLE;
  }

  CMU_CalibrateConfig(cycles, down_selection, up_selection);
  CMU_CalibrateCont(continuous_calibration);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Start the RCO calibration.
 ******************************************************************************/
void sli_clock_manager_hal_start_rco_calibration(void)
{
  CMU_CalibrateStart();
}

/***************************************************************************//**
 * Stop the RCO calibration.
 ******************************************************************************/
void sli_clock_manager_hal_stop_rco_calibration(void)
{
  CMU_CalibrateStop();
}

/***************************************************************************//**
 * Wait for the RCO calibration to finish.
 ******************************************************************************/
void sli_clock_manager_hal_wait_rco_calibration(void)
{
  // Wait until calibration completes, UNLESS continuous calibration mode is on
  if ((CMU->CALCTRL & CMU_CALCTRL_CONT) == 0UL) {
    // Wait until calibration completes
    while ((CMU->STATUS & CMU_STATUS_CALRDY) == 0UL) ;
  }
}

/***************************************************************************//**
 * Gets calibration count value.
 ******************************************************************************/
sl_status_t sli_clock_manager_hal_get_rco_calibration_count(uint32_t *count)
{
  *count = CMU->CALCNT;

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Updates SYSCLK clock source clock.
 ******************************************************************************/
sl_status_t sli_clock_manager_hal_set_sysclk_source(sl_oscillator_t source)
{
  switch (source) {
    case SL_OSCILLATOR_FSRCO:
      sli_em_cmu_SYSCLKInitPreClockSelect();
      CMU->SYSCLKCTRL = (CMU->SYSCLKCTRL & ~_CMU_SYSCLKCTRL_CLKSEL_MASK) | CMU_SYSCLKCTRL_CLKSEL_FSRCO;
      sli_em_cmu_SYSCLKInitPostClockSelect(false);
      break;
    case SL_OSCILLATOR_HFXO:
      sli_em_cmu_SYSCLKInitPreClockSelect();
      CMU->SYSCLKCTRL = (CMU->SYSCLKCTRL & ~_CMU_SYSCLKCTRL_CLKSEL_MASK) | CMU_SYSCLKCTRL_CLKSEL_HFXO;
      sli_em_cmu_SYSCLKInitPostClockSelect(false);
      break;
    case SL_OSCILLATOR_HFRCODPLL:
      sli_em_cmu_SYSCLKInitPreClockSelect();
      CMU->SYSCLKCTRL = (CMU->SYSCLKCTRL & ~_CMU_SYSCLKCTRL_CLKSEL_MASK) | CMU_SYSCLKCTRL_CLKSEL_HFRCODPLL;
      sli_em_cmu_SYSCLKInitPostClockSelect(false);
      break;
#if defined(CMU_SYSCLKCTRL_CLKSEL_RFFPLL0SYS)
    case SL_OSCILLATOR_RFFPLL:
      sli_em_cmu_SYSCLKInitPreClockSelect();
      CMU->SYSCLKCTRL = (CMU->SYSCLKCTRL & ~_CMU_SYSCLKCTRL_CLKSEL_MASK) | CMU_SYSCLKCTRL_CLKSEL_RFFPLL0SYS;
      sli_em_cmu_SYSCLKInitPostClockSelect(false);
      break;
#endif
    case SL_OSCILLATOR_CLKIN0:
      sli_em_cmu_SYSCLKInitPreClockSelect();
      CMU->SYSCLKCTRL = (CMU->SYSCLKCTRL & ~_CMU_SYSCLKCTRL_CLKSEL_MASK) | CMU_SYSCLKCTRL_CLKSEL_CLKIN0;
      sli_em_cmu_SYSCLKInitPostClockSelect(false);
      break;
    default:
      return SL_STATUS_INVALID_PARAMETER;
  }
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Gets SYSCLK clock source clock.
 ******************************************************************************/
sl_status_t sli_clock_manager_hal_get_sysclk_source(sl_oscillator_t *source)
{
  switch (CMU->SYSCLKCTRL & _CMU_SYSCLKCTRL_CLKSEL_MASK) {
    case  CMU_SYSCLKCTRL_CLKSEL_FSRCO:
      *source = SL_OSCILLATOR_FSRCO;
      break;
    case  CMU_SYSCLKCTRL_CLKSEL_HFXO:
      *source = SL_OSCILLATOR_HFXO;
      break;
    case  CMU_SYSCLKCTRL_CLKSEL_HFRCODPLL:
      *source = SL_OSCILLATOR_HFRCODPLL;
      break;
    case  CMU_SYSCLKCTRL_CLKSEL_CLKIN0:
      *source = SL_OSCILLATOR_CLKIN0;
      break;
#if defined(CMU_SYSCLKCTRL_CLKSEL_RFFPLL0SYS)
    case CMU_SYSCLKCTRL_CLKSEL_RFFPLL0SYS:
      *source = SL_OSCILLATOR_RFFPLL;
      break;
#endif
    default:
      EFM_ASSERT(false);
      break;
  }
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Waits for USBPLL clock to be ready.
 ******************************************************************************/
sl_status_t sli_clock_manager_hal_wait_usbpll(void)
{
#if defined(USBPLL_PRESENT)
  while ((USBPLL0->STATUS & (USBPLL_STATUS_PLLRDY | USBPLL_STATUS_PLLLOCK))
         != (USBPLL_STATUS_PLLRDY | USBPLL_STATUS_PLLLOCK)) {
    // Wait for USB PLL lock and ready
  }
  return SL_STATUS_OK;
#else
  return SL_STATUS_NOT_AVAILABLE;
#endif
}
